alexeyk13/rexos/kernel/stm32/stm32_otg.c
/*
    RExOS - embedded RTOS
    Copyright (c) 2011-2019, RExOS team
    All rights reserved.

    author: Alexey E. Kramarenko (alexeyk13@yandex.ru)
*/

#include "stm32_otg.h"
#include "stm32_regsusb.h"
#include "../../userspace/stm32/stm32_driver.h"
#include "stm32_power.h"
#include "../../userspace/sys.h"
#include "../../userspace/usb.h"
#include "../kerror.h"
#include "../kirq.h"
#include "../kexo.h"
#include "../../userspace/object.h"
#include "../../userspace/stdlib.h"
#include "../../userspace/power.h"
#include "../kstdlib.h"
#include <string.h>
#include "stm32_exo_private.h"

#define CORE_DEBUG               0
#define PIN_DEBUG                0


#if (PIN_DEBUG)
#include "config.h"
#include "gpio.h"
#endif

#if defined(STM32H7)
#if (STM32_USB_OTG_FS) && (STM32_USB_OTG_HS)
#define STM32_USB_DUAL            1
#else
#define STM32_USB_DUAL            0
#endif

typedef OTG_FS_DEVICE_TypeDef* OTG_FS_DEVICE_P;
typedef OTG_FS_GENERAL_TypeDef* OTG_FS_GENERAL_P;
typedef OTG_FS_PC_TypeDef* OTG_FS_PC_P;

static const OTG_FS_DEVICE_P __USB_DEVICE[] =   {OTG_FS_DEVICE, OTG_HS_DEVICE};
static const OTG_FS_GENERAL_P __USB_GENERAL[] =   {OTG_FS_GENERAL, OTG_HS_GENERAL};
static const OTG_FS_PC_P __USB_PC[] =   {OTG_FS_PC, OTG_HS_PC};
static const uint32_t __USB_FIFO_BASE[] =   {OTG_FS_FIFO_BASE, OTG_HS_FIFO_BASE};

static const uint32_t __USB_EP_OUT_IRQ[] = {OTG_FS_EP1_OUT_IRQn, OTG_HS_EP1_OUT_IRQn};
static const uint32_t __USB_EP_IN_IRQ[] =  {OTG_FS_EP1_IN_IRQn, OTG_HS_EP1_IN_IRQn};
static const uint32_t __USB_WKUP_IRQ[] =   {OTG_FS_WKUP_IRQn, OTG_HS_WKUP_IRQn};
static const uint32_t __USB_IRQ[] =        {OTG_FS_IRQn, OTG_HS_IRQn};


#if(STM32_USB_DUAL == 0)

#if (STM32_USB_OTG_FS)
#define  _OTG_DEVICE     __USB_DEVICE[0]
#define  _OTG_GENERAL    __USB_GENERAL[0]
#define  _OTG_FIFO_BASE  __USB_FIFO_BASE[0]
#define  _OTG_PC         __USB_PC[0]

#define  _OTG_EP_OUT_IRQ __USB_EP_OUT_IRQ[0]
#define  _OTG_EP_IN_IRQ  __USB_EP_IN_IRQ[0]
#define  _OTG_WKUP_IRQ   __USB_WKUP_IRQ[0]
#define  _OTG_IRQ        __USB_IRQ[0]

#elif (STM32_USB_OTG_HS)
#define  _OTG_DEVICE  __USB_DEVICE[1]
#define  _OTG_GENERAL __USB_GENERAL[1]
#define  _OTG_FIFO_BASE __USB_FIFO_BASE[1]
#define  _OTG_PC         __USB_PC[1]

#define  _OTG_EP_OUT_IRQ __USB_EP_OUT_IRQ[1]
#define  _OTG_EP_IN_IRQ  __USB_EP_IN_IRQ[1]
#define  _OTG_WKUP_IRQ   __USB_WKUP_IRQ[1]
#define  _OTG_IRQ        __USB_IRQ[1]

#else
#error define usb instance
#endif
#endif //STM32_USB_DUAL


#else
#define  _OTG_IRQ OTG_FS_IRQn
#endif //STM32H7

#define ALIGN_SIZE                                          (sizeof(int))
#define ALIGN(var)                                          (((var) + (ALIGN_SIZE - 1)) & ~(ALIGN_SIZE - 1))


#define GET_CORE_CLOCK          stm32_power_get_clock_inside(exo, POWER_CORE_CLOCK)

static inline OTG_FS_DEVICE_ENDPOINT_TypeDef* ep_reg_data(USB_PORT_TYPE port, int num)
{
    return (num & USB_EP_IN) ? &(_OTG_DEVICE->INEP[USB_EP_NUM(num)]) : &(_OTG_DEVICE->OUTEP[USB_EP_NUM(num)]);
}

static inline EP* ep_data(USB_PORT_TYPE port, EXO* exo, int num)
{
    return (num & USB_EP_IN) ? (exo->usb.in[USB_EP_NUM(num)]) : (exo->usb.out[USB_EP_NUM(num)]);
}

static inline void usb_reset_all()
{
#if defined(STM32H7)
       _OTG_GENERAL->RSTCTL |= OTG_FS_GENERAL_RSTCTL_CSRST;
       while (_OTG_GENERAL->RSTCTL & OTG_FS_GENERAL_RSTCTL_CSRST) {};
       _OTG_GENERAL->AHBCFG = OTG_FS_GENERAL_AHBCFG_GINT;

       _OTG_GENERAL->RXFSIZ = ((STM32_USB_MPS / 4) + 1) * 2 + 10 + 1;
       _OTG_GENERAL->TX0FSIZ = (0x20  << OTG_FS_GENERAL_TX0FSIZ_TX0FD_POS) | (_OTG_GENERAL->RXFSIZ << OTG_FS_GENERAL_TX0FSIZ_TX0FSA_POS);

       //repeat setup after reset
   #if (STM32_USB_OTG_ULPI)
       _OTG_GENERAL->USBCFG =  (1 << 20) |  (0 << 15) | OTG_FS_GENERAL_USBCFG_FDMOD | (9 << OTG_FS_GENERAL_USBCFG_TRDT_POS) | (17 << OTG_FS_GENERAL_USBCFG_TOCAL_POS);
   #else
       _OTG_GENERAL->USBCFG = (1 << 15) | OTG_FS_GENERAL_USBCFG_FDMOD | (trdt << OTG_FS_GENERAL_USBCFG_TRDT_POS) | OTG_FS_GENERAL_USBCFG_PHYSEL | (17 << OTG_FS_GENERAL_USBCFG_TOCAL_POS);
   #endif // STM32_USB_OTG_ULPI

       _OTG_GENERAL->INTMSK = OTG_FS_GENERAL_INTMSK_USBSUSPM | OTG_FS_GENERAL_INTMSK_ENUMDNEM |
               OTG_FS_GENERAL_INTMSK_IEPM | OTG_FS_GENERAL_INTMSK_RXFLVLM | OTG_FS_GENERAL_INTMSK_USBRSTM ;

       _OTG_GENERAL->CCFG |= OTG_FS_GENERAL_CCFG_VBUSBSEN;
       _OTG_DEVICE->IEPMSK = OTG_FS_DEVICE_IEPMSK_XFRCM;
       _OTG_DEVICE->CTL = OTG_FS_DEVICE_CTL_POPRGDNE;

       _OTG_GENERAL->INTMSK |= OTG_FS_GENERAL_INTMSK_OTGM;
#endif // STM32H7
}

static bool stm32_otg_ep_flush(USB_PORT_TYPE port, EXO* exo, int num)
{
    EP* ep = ep_data(port, exo, num);
    if (ep == NULL)
    {
        kerror(ERROR_NOT_CONFIGURED);
        return false;
    }
    if (ep->io != NULL)
    {
        kexo_io_ex(exo->usb.device, HAL_IO_CMD(HAL_USB, (num & USB_EP_IN) ? IPC_WRITE : IPC_READ), num, ep->io, ERROR_IO_CANCELLED);
        ep->io = NULL;
        ep_reg_data(port, num)->CTL |= OTG_FS_DEVICE_ENDPOINT_CTL_SNAK | OTG_FS_DEVICE_ENDPOINT_CTL_EPDIS;
    }
    ep->io_active = false;
    if(num & USB_EP_IN)
    {
         _OTG_GENERAL->RSTCTL = ((1 << 5) | (USB_EP_NUM(num) << 6));
        while ((_OTG_GENERAL->RSTCTL & OTG_HS_GENERAL_RSTCTL_TXFFLSH) == OTG_HS_GENERAL_RSTCTL_TXFFLSH);

    }
    return true;
}

static inline void stm32_otg_ep_set_stall(USB_PORT_TYPE port, EXO* exo, int num)
{
    if (!stm32_otg_ep_flush(port, exo, num))
        return;
    ep_reg_data(port, num)->CTL |= OTG_FS_DEVICE_ENDPOINT_CTL_STALL;
}

static inline void stm32_otg_ep_clear_stall(USB_PORT_TYPE port, EXO* exo, int num)
{
    if (!stm32_otg_ep_flush(port, exo, num))
        return;
    ep_reg_data(port, num)->CTL &= ~OTG_FS_DEVICE_ENDPOINT_CTL_STALL;
}

static inline bool stm32_otg_ep_is_stall(USB_PORT_TYPE port, int num)
{
    return ep_reg_data(port, num)->CTL & OTG_FS_DEVICE_ENDPOINT_CTL_STALL ? true : false;
}

static inline void usb_suspend(EXO* exo)
{
    usb_reset_all();
    IPC ipc;
    _OTG_GENERAL->INTMSK &= ~OTG_FS_GENERAL_INTMSK_USBSUSPM;
    ipc.process = exo->usb.device;
    ipc.param1 = USB_HANDLE_DEVICE;
    ipc.cmd = HAL_CMD(HAL_USB, USB_SUSPEND);
    ipc_ipost(&ipc);
}

static inline void usb_wakeup(EXO* exo)
{
    IPC ipc;
    _OTG_GENERAL->INTMSK |= OTG_FS_GENERAL_INTMSK_USBSUSPM;
    ipc.process = exo->usb.device;
    ipc.param1 = USB_HANDLE_DEVICE;
    ipc.cmd = HAL_CMD(HAL_USB, USB_WAKEUP);
    ipc_ipost(&ipc);
}

