alexeyk13/rexos/kernel/stm32/stm32_otg.c
static void stm32_otg_rx_prepare(EXO* exo, unsigned int ep_num)
{
    EP* ep = exo->usb.out[ep_num];
    int size = ep->size - ep->io->data_size;

    uint32_t pkt_cnt;
    pkt_cnt = ((size + ep->mps - 1) / ep->mps);
    if(pkt_cnt == 0 )
        pkt_cnt = 1;
    size = pkt_cnt *  ep->mps;
    if (ep_num)
        _OTG_DEVICE->OUTEP[ep_num].TSIZ = (pkt_cnt << OTG_FS_DEVICE_ENDPOINT_TSIZ_PKTCNT_POS) | (size << OTG_FS_DEVICE_ENDPOINT_TSIZ_XFRSIZ_POS);
    else //EP0
        _OTG_DEVICE->OUTEP[0].TSIZ = (pkt_cnt << OTG_FS_DEVICE_ENDPOINT_TSIZ_PKTCNT_POS) | (size << OTG_FS_DEVICE_ENDPOINT_TSIZ_XFRSIZ_POS) |
                                       (3 << OTG_FS_DEVICE_ENDPOINT_TSIZ_STUPCNT_OUT0_POS);

    _OTG_DEVICE->OUTEP[ep_num].CTL |= OTG_FS_DEVICE_ENDPOINT_CTL_EPENA | OTG_FS_DEVICE_ENDPOINT_CTL_CNAK;
}

static void memcpy4(void* dst, void* src, int size)
{
    int* dst1 = dst;
    int* src1 = src;
    size = ALIGN(size) /4;
    __disable_irq();         // stm32h7 workaround!

    while(size--)
        *dst1++ = *src1++;
    __enable_irq();
}

static inline void stm32_otg_tx(EXO* exo, int num)
{
    uint32_t pkt_cnt;
    bool use_int = false;
    num = USB_EP_NUM(num);
    EP* ep = exo->usb.in[num];
    int size = ep->io->data_size - ep->size;

#if (CORE_DEBUG)
    printk("t:%d e:%d\n",size, num);
#endif //CORE_DEBUG

    pkt_cnt = ((size + ep->mps - 1) / ep->mps);
    if(pkt_cnt == 0 )
        pkt_cnt = 1;

    _OTG_DEVICE->INEP[num].TSIZ = (pkt_cnt << OTG_FS_DEVICE_ENDPOINT_TSIZ_PKTCNT_POS) | (size << OTG_FS_DEVICE_ENDPOINT_TSIZ_XFRSIZ_POS);

    if(size > _OTG_DEVICE->INEP[num].FSTS * 4)
    {
        size = _OTG_DEVICE->INEP[num].FSTS * 4;
        use_int = true;
    }

    _OTG_DEVICE->INEP[num].CTL |= OTG_FS_DEVICE_ENDPOINT_CTL_EPENA | OTG_FS_DEVICE_ENDPOINT_CTL_CNAK;

#if (PIN_DEBUG)
    gpio_set_pin(TEST1_PIN);
    memcpy4((void*)(_OTG_FIFO_BASE + USB_EP_NUM(num) * 0x1000), io_data(ep->io) +  ep->size, size);
    gpio_reset_pin(TEST1_PIN);
#else
    if(size)
        memcpy4((void*)(_OTG_FIFO_BASE + USB_EP_NUM(num) * 0x1000), io_data(ep->io) +  ep->size, size);
#endif // PIN_DEBUG
    ep->size += size;
    if(use_int)
        _OTG_DEVICE->EIPEMPMSK |= (1 << num);
}

USB_SPEED stm32_otg_get_speed(EXO* exo)
{
#if defined(STM32H7) || defined(STM32F4)
    if (_OTG_DEVICE->CFG & OTG_FS_DEVICE_CFG_DSPD_FS)
        return USB_FULL_SPEED;
    else
        return USB_HIGH_SPEED;
#else
    //according to datasheet STM32F1_CL doesn't support low speed mode...
    return USB_FULL_SPEED;
#endif
}

static inline void usb_enumdne(EXO* exo)
{
    _OTG_GENERAL->INTMSK |= OTG_FS_GENERAL_INTMSK_USBSUSPM;
    IPC ipc;
    ipc.process = exo->usb.device;
    ipc.param1 = USB_HANDLE_DEVICE;
    ipc.param2 = stm32_otg_get_speed(exo);
    ipc.cmd = HAL_CMD(HAL_USB, USB_RESET);
    ipc_ipost(&ipc);
}

//--------------------------ISR -------------------------------------------
static inline void stm32_otg_on_isr_rx(EXO* exo)
{
    IPC ipc;
    unsigned int sta = _OTG_GENERAL->RXSTSP;
    unsigned int pktsts = sta & OTG_FS_GENERAL_RXSTSR_PKTSTS;
    int bcnt = (sta & OTG_FS_GENERAL_RXSTSR_BCNT) >> OTG_FS_GENERAL_RXSTSR_BCNT_POS;
    unsigned int ep_num = (sta & OTG_FS_GENERAL_RXSTSR_EPNUM) >> OTG_FS_GENERAL_RXSTSR_EPNUM_POS;
    EP* ep = exo->usb.out[ep_num];
#if (CORE_DEBUG)
    printk("sts:%x\n", sta);
#endif //CORE_DEBUG
    if (pktsts == OTG_FS_GENERAL_RXSTSR_PKTSTS_SETUP_RX)
    {
//ignore all data on setup packet
        exo->usb.setup_lo = ((uint32_t*)(_OTG_FIFO_BASE + ep_num * 0x1000))[0];
        exo->usb.setup_hi = ((uint32_t*)(_OTG_FIFO_BASE + ep_num * 0x1000))[0];
#if (CORE_DEBUG)
        printk("s:%x %x\n", exo->usb.setup_lo, exo->usb.setup_hi);
#endif //CORE_DEBUG

    }
    else  if ((pktsts == OTG_FS_GENERAL_RXSTSR_PKTSTS_SETUP_DONE))
    {
#if (CORE_DEBUG)
    printk("sd\n");
#endif //CORE_DEBUG
        ipc.process = exo->usb.device;
        ipc.cmd = HAL_CMD(HAL_USB, USB_SETUP);
        ipc.param1 = USB_HANDLE(USB_0, 0);
        ipc.param2 = exo->usb.setup_lo;
        ipc.param3 = exo->usb.setup_hi;
        ipc_ipost(&ipc);
        _OTG_DEVICE->OUTEP[0].INT = OTG_FS_DEVICE_ENDPOINT_INT_STUP;
    }
    else  if ((pktsts == OTG_FS_GENERAL_RXSTSR_PKTSTS_OUT_RX) && bcnt)
    {
#if (CORE_DEBUG)
       printk("r:%d e:%d\n",bcnt, ep_num);
#endif //CORE_DEBUG
        memcpy4(io_data(ep->io) + ep->io->data_size, (void*)(_OTG_FIFO_BASE + ep_num * 0x1000), bcnt);
        ep->io->data_size += bcnt;
    }
    else  if (pktsts == OTG_FS_GENERAL_RXSTSR_PKTSTS_OUT_DONE)
    {
        iio_complete(exo->usb.device, HAL_IO_CMD(HAL_USB, IPC_READ), ep_num, ep->io);
        ep->io_active = false;
        ep->io = NULL;
        _OTG_DEVICE->OUTEP[ep_num].INT = OTG_FS_DEVICE_ENDPOINT_INT_XFRC | OTG_FS_DEVICE_ENDPOINT_INT_OTEPDIS | OTG_FS_DEVICE_ENDPOINT_INT_NAK ;
    }

    _OTG_GENERAL->INTMSK |= OTG_FS_GENERAL_INTMSK_RXFLVLM;
}

static inline void stm32_otg_on_isr_tx_fifo_empty(EXO* exo, int num)
{
    EP* ep = exo->usb.in[num];
    int size = ep->io->data_size - ep->size;
    if(size <= 0)
    {
        _OTG_DEVICE->EIPEMPMSK &= ~(1 << num);
        return;
    }

    if(size > _OTG_DEVICE->INEP[num].FSTS * 4)
        size = _OTG_DEVICE->INEP[num].FSTS * 4;
    else
        _OTG_DEVICE->EIPEMPMSK &= ~(1 << num);

#if (CORE_DEBUG)
    printk("S:%d\n", ep->size);
#endif //CORE_DEBUG

#if (PIN_DEBUG)
    gpio_set_pin(TEST1_PIN);
    memcpy4((void*)(_OTG_FIFO_BASE + num * 0x1000), io_data(ep->io) +  ep->size, size);
    gpio_reset_pin(TEST1_PIN);
#else
    memcpy4((void*)(_OTG_FIFO_BASE + num * 0x1000), io_data(ep->io) +  ep->size, size);
#endif // PIN_DEBUG

    ep->size += size;
}

static inline void stm32_otg_on_isr_tx(EXO* exo, uint32_t num)
{
    EP* ep = exo->usb.in[num];
    if (_OTG_DEVICE->INEP[num].INT & OTG_FS_DEVICE_ENDPOINT_INT_XFRC)
    {
        _OTG_DEVICE->INEP[num].INT = OTG_FS_DEVICE_ENDPOINT_INT_XFRC;
        ep->io_active = false;
        iio_complete(exo->usb.device, HAL_IO_CMD(HAL_USB, IPC_WRITE), USB_EP_IN | num, ep->io);
        ep->io = NULL;
        return;
    }

    if(_OTG_DEVICE->INEP[num].INT & OTG_FS_DEVICE_ENDPOINT_INT_TXFE/* && ep->io_active*/)
        stm32_otg_on_isr_tx_fifo_empty(exo, num);
}

static inline void usb_on_isr_reset()
{
    _OTG_DEVICE->CFG &= OTG_FS_DEVICE_CFG_DAD;
}

static void usb_on_isr(int vector, void* param)
{
    EXO* exo = param;
    unsigned int sta = _OTG_GENERAL->INTSTS;
#if (CORE_DEBUG)
    printk("%x\n",sta);
#endif //CORE_DEBUG
    //first two most often called
    if ((_OTG_GENERAL->INTMSK & OTG_FS_GENERAL_INTMSK_RXFLVLM) && (sta & OTG_FS_GENERAL_INTSTS_RXFLVL))
    {
        //mask interrupts, will be umasked by process after FIFO read
        _OTG_GENERAL->INTMSK &= ~OTG_FS_GENERAL_INTMSK_RXFLVLM;
        stm32_otg_on_isr_rx(exo);
        return;
    }

    uint32_t num;
    num = 32- __CLZ(_OTG_DEVICE->AINT & 0xff);
    if(num)
    {
        stm32_otg_on_isr_tx(exo, num-1);
        return;
    }

    //rarely called
    if (sta & OTG_FS_GENERAL_INTSTS_ENUMDNE)
    {
#if (CORE_DEBUG)
        printk("rst\n");
#endif //CORE_DEBUG
        usb_enumdne(exo);
        _OTG_GENERAL->INTSTS |= OTG_FS_GENERAL_INTSTS_ENUMDNE;
        return;
    }
    if ((sta & OTG_FS_GENERAL_INTSTS_USBSUSP) && (_OTG_GENERAL->INTMSK & OTG_FS_GENERAL_INTMSK_USBSUSPM))
    {
        usb_suspend(exo);
        _OTG_GENERAL->INTSTS |= OTG_FS_GENERAL_INTSTS_USBSUSP;
        return;
    }
    if (sta & OTG_FS_GENERAL_INTSTS_WKUPINT)
    {
        usb_wakeup(exo);
        _OTG_GENERAL->INTSTS |= OTG_FS_GENERAL_INTSTS_WKUPINT | OTG_FS_GENERAL_INTSTS_USBSUSP;
    }

    if (sta & OTG_FS_GENERAL_INTSTS_USBRST)
    {
        usb_on_isr_reset();
        _OTG_GENERAL->INTSTS |= OTG_FS_GENERAL_INTSTS_USBRST;
    }
    _OTG_GENERAL->OTGINT  = 0xFFFFFF;// clear other request
}
//------------------------------------------------------------------------
static void small_delay()
{
    int i;
    for(i = 0; i < 1000; i++) __NOP();
}

static void stm32_otg_open_device(EXO* exo, HANDLE device)
{
    int trdt;
    exo->usb.device = device;

    //enable GPIO
#if defined(STM32H7)
    PWR->CR3 |= PWR_CR3_USB33DEN;
#if (STM32_USB_CRYSTALLESS)
    RCC->CR |= RCC_CR_HSI48ON;
    while((RCC->CR & RCC_CR_HSI48RDY) == 0);
#endif

#if (USB_CLOCK_SRC == USB_CLOCK_SRC_PLL3_Q)
    stm32_power_pll3_on();
#endif

    RCC->D2CCIP2R = (RCC->D2CCIP2R & ~RCC_D2CCIP2R_USBSEL_Msk) | USB_CLOCK_SRC;

