alexeyk13/rexos/kernel/stm32/stm32_otg.c
#if (STM32_USB_OTG_FS)
    RCC->AHB1ENR |= RCC_AHB1ENR_USB2OTGFSEN;
#endif
#if (STM32_USB_OTG_HS)
    RCC->AHB1ENR |= RCC_AHB1ENR_USB1OTGHSEN;
#if (STM32_USB_OTG_ULPI)
    RCC->AHB1ENR |= RCC_AHB1ENR_USB1OTGHSULPIEN;
#endif // STM32_USB_OTG_ULPI
#endif
    small_delay();
    trdt = 6;

#else // STM32H7
    stm32_pin_request_inside(exo, HAL_REQ(HAL_PIN, IPC_OPEN), A9, STM32_GPIO_MODE_INPUT_FLOAT, false);
    stm32_pin_request_inside(exo, HAL_REQ(HAL_PIN, IPC_OPEN), A10, STM32_GPIO_MODE_INPUT_PULL, true);
    //enable clock, setup prescaller
    switch (GET_CORE_CLOCK)
    {
    case 72000000:
        RCC->CFGR &= ~(1 << 22);
        break;
    case 48000000:
        RCC->CFGR |= 1 << 22;
        break;
    default:
        kerror(ERROR_NOT_SUPPORTED);
        return;
    }
#if defined(STM32F10X_CL)
    //enable clock
    RCC->AHBENR |= RCC_AHBENR_OTGFSEN;
    //F100, F101, F103
#elif defined(STM32F1)
    RCC->APB1ENR |= RCC_APB1ENR_USBEN;
#endif
    trdt = GET_CORE_CLOCK == 72000000 ? 9 : 5;
    kirq_register(KERNEL_HANDLE, OTG_FS_IRQn, usb_on_isr, exo);
    NVIC_EnableIRQ(OTG_FS_IRQn);
    NVIC_SetPriority(OTG_FS_IRQn, 13);

#endif // STM32H7

#if (STM32_USB_OTG_ULPI)
    trdt = 9;
    _OTG_GENERAL->CCFG = 0;
    //disable HNP/SRP
    _OTG_GENERAL->OTGCTL = 0;
    //Device init: for stm32h7 must select phy and device mode before reset.
    _OTG_DEVICE->CFG = 0 | (1 << 14);
    _OTG_GENERAL->USBCFG =  (1 << 21) | (0 << 15) | OTG_FS_GENERAL_USBCFG_FDMOD | (trdt << OTG_FS_GENERAL_USBCFG_TRDT_POS) | (17 << OTG_FS_GENERAL_USBCFG_TOCAL_POS);
#else
    _OTG_GENERAL->CCFG = OTG_FS_GENERAL_CCFG_PWRDWN;
    //disable HNP/SRP
    _OTG_GENERAL->OTGCTL = 0;
    //Device init: for stm32h7 must select phy and device mode before reset.
    _OTG_DEVICE->CFG = OTG_FS_DEVICE_CFG_DSPD_FS;
    _OTG_GENERAL->USBCFG = (OTG_FS_GENERAL_USBCFG_FYLPC << 15) | OTG_FS_GENERAL_USBCFG_FDMOD | (trdt << OTG_FS_GENERAL_USBCFG_TRDT_POS) | OTG_FS_GENERAL_USBCFG_PHYSEL | (17 << OTG_FS_GENERAL_USBCFG_TOCAL_POS);
#endif // STM32_USB_OTG_ULPI

    //reset core
    _OTG_GENERAL->RSTCTL |= OTG_FS_GENERAL_RSTCTL_CSRST;
    while (_OTG_GENERAL->RSTCTL & OTG_FS_GENERAL_RSTCTL_CSRST) {};
    while ((_OTG_GENERAL->RSTCTL & OTG_FS_GENERAL_RSTCTL_AHBIDL) == 0) {}
    small_delay();

    //refer to programming manual: 1. Setup AHB
    _OTG_GENERAL->AHBCFG = OTG_FS_GENERAL_AHBCFG_GINT;

    _OTG_GENERAL->RXFSIZ = ((STM32_USB_MPS / 4) + 1) * 2 + 10 + 1;
    _OTG_GENERAL->TX0FSIZ = (0x20  << OTG_FS_GENERAL_TX0FSIZ_TX0FD_POS) | (_OTG_GENERAL->RXFSIZ << OTG_FS_GENERAL_TX0FSIZ_TX0FSA_POS);

    //repeat setup after reset
#if (STM32_USB_OTG_ULPI)
    _OTG_GENERAL->USBCFG =  (1 << 20) |  (0 << 15) | OTG_FS_GENERAL_USBCFG_FDMOD | (trdt << OTG_FS_GENERAL_USBCFG_TRDT_POS) | (17 << OTG_FS_GENERAL_USBCFG_TOCAL_POS);
#else
    _OTG_GENERAL->USBCFG = (1 << 15) | OTG_FS_GENERAL_USBCFG_FDMOD | (trdt << OTG_FS_GENERAL_USBCFG_TRDT_POS) | OTG_FS_GENERAL_USBCFG_PHYSEL | (17 << OTG_FS_GENERAL_USBCFG_TOCAL_POS);
#endif // STM32_USB_OTG_ULPI
    //2.
    _OTG_GENERAL->INTMSK = OTG_FS_GENERAL_INTMSK_USBSUSPM | OTG_FS_GENERAL_INTMSK_ENUMDNEM |
            OTG_FS_GENERAL_INTMSK_IEPM | OTG_FS_GENERAL_INTMSK_RXFLVLM | OTG_FS_GENERAL_INTMSK_USBRSTM ;

    //3.
    _OTG_GENERAL->CCFG |= OTG_FS_GENERAL_CCFG_VBUSBSEN;
    //disable endpoint interrupts, except IN XFRC
    _OTG_DEVICE->IEPMSK = OTG_FS_DEVICE_IEPMSK_XFRCM;
    _OTG_DEVICE->OEPMSK = 0;// | OTG_FS_DEVICE_IEPMSK_XFRCM;
    _OTG_DEVICE->CTL = OTG_FS_DEVICE_CTL_POPRGDNE;

    //Setup data FIFO
    _OTG_GENERAL->RXFSIZ = ((STM32_USB_MPS / 4) + 1) * 2 + 10 + 1;

    //enable interrupts
#if defined(STM32H7)
    kirq_register(KERNEL_HANDLE, _OTG_WKUP_IRQ, usb_on_isr, exo);
    NVIC_EnableIRQ(_OTG_WKUP_IRQ);
#endif// STM32H7

    kirq_register(KERNEL_HANDLE, _OTG_IRQ, usb_on_isr, exo);
    NVIC_EnableIRQ(_OTG_IRQ);
    NVIC_SetPriority(_OTG_IRQ, 13);

    //Unmask global interrupts
    _OTG_GENERAL->INTMSK |= OTG_FS_GENERAL_INTMSK_OTGM;
}

static inline void stm32_otg_open_ep(USB_PORT_TYPE port, EXO* exo, int num, USB_EP_TYPE type, unsigned int size)
{
    if (ep_data(port, exo, num) != NULL)
    {
        kerror(ERROR_ALREADY_CONFIGURED);
        return;
    }
    EP* ep = kmalloc(sizeof(EP));
    if (ep == NULL)
        return;
    num & USB_EP_IN ? (exo->usb.in[USB_EP_NUM(num)] = ep) : (exo->usb.out[USB_EP_NUM(num)] = ep);
    ep->io = NULL;
    ep->mps = size;
    ep->io_active = false;

    int fifo_used, i;
    //enable, NAK
    uint32_t ctl = OTG_FS_DEVICE_ENDPOINT_CTL_USBAEP | OTG_FS_DEVICE_ENDPOINT_CTL_SNAK;
    //setup ep type, DATA0 for bulk/interrupt, EVEN frame for isochronous endpoint
    switch (type)
    {
    case USB_EP_CONTROL:
        ctl |= OTG_FS_DEVICE_ENDPOINT_CTL_EPTYP_CONTROL;
        break;
    case USB_EP_BULK:
        ctl |= OTG_FS_DEVICE_ENDPOINT_CTL_EPTYP_BULK | OTG_FS_DEVICE_ENDPOINT_CTL_DPID;
        break;
    case USB_EP_INTERRUPT:
        ctl |= OTG_FS_DEVICE_ENDPOINT_CTL_EPTYP_INTERRUPT | OTG_FS_DEVICE_ENDPOINT_CTL_DPID;
        break;
    case USB_EP_ISOCHRON:
        ctl |= OTG_FS_DEVICE_ENDPOINT_CTL_EPTYP_ISOCHRONOUS | OTG_FS_DEVICE_ENDPOINT_CTL_SEVNFRM;
        break;
    }
#if (CORE_DEBUG)
        printk("EP %d open \n", num );
#endif //CORE_DEBUG

    if (num & USB_EP_IN)
    {
        uint32_t fifo_size;
        //setup TX FIFO num for IN endpoint
        fifo_used =_OTG_GENERAL->RXFSIZ & 0xffff;
        for (i = 0; i < USB_EP_COUNT_MAX; ++i)
        {
            if(exo->usb.in[i] == NULL)
                continue;

            fifo_size = exo->usb.in[i]->mps / 2;
            if(fifo_size < 16)
                fifo_size = 16;

            if(i)
                _OTG_GENERAL->DIEPTXF[i - 1] = (fifo_size << OTG_FS_GENERAL_TX0FSIZ_TX0FD_POS) | ((fifo_used * 1) <<OTG_FS_GENERAL_TX0FSIZ_TX0FSA_POS);
            else
                _OTG_GENERAL->TX0FSIZ = (fifo_size  << OTG_FS_GENERAL_TX0FSIZ_TX0FD_POS) | ((fifo_used * 1) << OTG_FS_GENERAL_TX0FSIZ_TX0FSA_POS);
            fifo_used += fifo_size;
        }
        ctl |= (USB_EP_NUM(num)) << OTG_FS_DEVICE_ENDPOINT_CTL_TXFNUM_POS;

        //enable interrupts for XFRCM
        _OTG_DEVICE->AINTMSK |= 1 << USB_EP_NUM(num);
    }

    //EP_OUT0 has differrent mps structure
    if (USB_EP_NUM(num) == 0)
    {
        switch (size)
        {
        case 8:
            ctl |= OTG_FS_DEVICE_ENDPOINT_CTL_MPSIZ0_8;
            break;
        case 16:
            ctl |= OTG_FS_DEVICE_ENDPOINT_CTL_MPSIZ0_16;
            break;
        case 32:
            ctl |= OTG_FS_DEVICE_ENDPOINT_CTL_MPSIZ0_32;
            break;
        default:
            ctl |= OTG_FS_DEVICE_ENDPOINT_CTL_MPSIZ0_64;
        }
    }
    else
        ctl |= size;

