alexeyk13/rexos/kernel/stm32/stm32_otg.c
    ep_reg_data(port, num)->CTL = ctl;
}

static inline void stm32_otg_close_ep(USB_PORT_TYPE port, EXO* exo, int num)
{
    if (!stm32_otg_ep_flush(port, exo, num))
        return;
    ep_reg_data(port, num)->CTL &= ~OTG_FS_DEVICE_ENDPOINT_CTL_USBAEP;
    EP* ep = ep_data(port, exo, num);

    ep->mps = 0;
    if (num & USB_EP_IN)
    {
        _OTG_DEVICE->AINTMSK &= ~(1 << USB_EP_NUM(num));
        _OTG_DEVICE->EIPEMPMSK &= ~(1 << USB_EP_NUM(num));
    }
    kfree(ep);
    num & USB_EP_IN ? (exo->usb.in[USB_EP_NUM(num)] = NULL) : (exo->usb.out[USB_EP_NUM(num)] = NULL);
}

static inline void stm32_otg_close_device(USB_PORT_TYPE port, EXO* exo)
{
    int i;
    //Mask global interrupts
    _OTG_GENERAL->INTMSK &= ~OTG_FS_GENERAL_INTMSK_OTGM;

    //disable interrupts
    NVIC_DisableIRQ(OTG_FS_IRQn);
    kirq_unregister(KERNEL_HANDLE, OTG_FS_IRQn);

    //close all endpoints
    for (i = 0; i < USB_EP_COUNT_MAX; ++i)
    {
        if (exo->usb.out[i] != NULL)
            stm32_otg_close_ep(port, exo, i);
        if (exo->usb.in[i] != NULL)
            stm32_otg_close_ep(port, exo, USB_EP_IN | i);
    }
    exo->usb.device = INVALID_HANDLE;

    //power down
#if defined(STM32F10X_CL)
    //disable clock
    RCC->AHBENR &= ~RCC_AHBENR_OTGFSEN;
    //F100, F101, F103
#elif defined(STM32F1)
    RCC->APB1ENR &= ~RCC_APB1ENR_USBEN;
#endif
#if defined(STM32H7)
    RCC->AHB1ENR &= ~(RCC_AHB1ENR_USB2OTGFSEN | RCC_AHB1ENR_USB1OTGHSEN | RCC_AHB1ENR_USB1OTGHSULPIEN);
#else
    //disable pins
    stm32_pin_request_inside(exo, HAL_REQ(HAL_PIN, IPC_CLOSE), A9, 0, 0);
    stm32_pin_request_inside(exo, HAL_REQ(HAL_PIN, IPC_CLOSE), A10, 0, 0);
#endif//STM32H7

}

static inline void stm32_otg_set_address(int addr)
{
#if (CORE_DEBUG)
        printk("set ADDR %d\n", addr );
#endif //CORE_DEBUG
    _OTG_DEVICE->CFG &= OTG_FS_DEVICE_CFG_DAD;
    _OTG_DEVICE->CFG |= addr << OTG_FS_DEVICE_CFG_DAD_POS;
}

static bool stm32_usb_io_prepare(EXO* exo, IPC* ipc)
{
    EP* ep = ep_data(USB_PORT(ipc->param1), exo, ipc->param1);
    if (ep == NULL)
    {
        printk("ep==null");
        kerror(ERROR_NOT_CONFIGURED);
        return false;
    }
    if (ep->io_active)
    {
        printk("ep->io_active");
        kerror(ERROR_IN_PROGRESS);
        return false;
    }
    ep->io = (IO*)ipc->param2;
    kerror(ERROR_SYNC);
    return true;
}

static inline void stm32_otg_read(EXO* exo, IPC* ipc)
{
    unsigned int ep_num = USB_EP_NUM(ipc->param1);
    EP* ep = exo->usb.out[ep_num];
    if (stm32_usb_io_prepare(exo, ipc))
    {
        ep->io->data_size = 0;
        ep->size = ipc->param3;
        ep->io_active = true;
        stm32_otg_rx_prepare(exo, ep_num);
    }
}

static inline void stm32_otg_write(EXO* exo, IPC* ipc)
{
    unsigned int ep_num = USB_EP_NUM(ipc->param1);
    EP* ep = exo->usb.in[ep_num];
    if (stm32_usb_io_prepare(exo, ipc))
    {
        ep->size = 0;
        ep->io_active = true;
        stm32_otg_tx(exo, USB_EP_IN | ep_num);
    }
}

#if (USB_TEST_MODE_SUPPORT)
static inline void stm32_otg_set_test_mode(EXO* exo, USB_TEST_MODES test_mode)
{
    _OTG_DEVICE->CTL &= ~OTG_FS_DEVICE_CTL_TCTL;
    _OTG_DEVICE->CTL |= test_mode << OTG_FS_DEVICE_CTL_TCTL_POS;
}
#endif //USB_TEST_MODE_SUPPORT

void stm32_otg_init(EXO* exo)
{
    int i;
    exo->usb.device = INVALID_HANDLE;
    for (i = 0; i < USB_EP_COUNT_MAX; ++i)
    {
        exo->usb.out[i] = NULL;
        exo->usb.in[i] = NULL;
    }
}

static inline void stm32_otg_device_request(EXO* exo, IPC* ipc)
{
    switch (HAL_ITEM(ipc->cmd))
    {
    case USB_GET_SPEED:
        ipc->param2 = stm32_otg_get_speed(exo);
        break;
    case IPC_OPEN:
        stm32_otg_open_device(exo, ipc->process);
        break;
    case IPC_CLOSE:
        stm32_otg_close_device(USB_PORT(ipc->param1), exo);
        break;
    case USB_SET_ADDRESS:
        stm32_otg_set_address(ipc->param2);
        break;
#if (USB_TEST_MODE_SUPPORT)
    case USB_SET_TEST_MODE:
        stm32_otg_set_test_mode(exo, ipc->param2);
        break;
#endif //USB_TEST_MODE_SUPPORT
    default:
        kerror(ERROR_NOT_SUPPORTED);
        break;
    }
}


static void stm32_otg_ep_request(EXO* exo, IPC* ipc)
{
    if (USB_EP_NUM(ipc->param1) >= USB_EP_COUNT_MAX)
    {
        kerror(ERROR_INVALID_PARAMS);
        return;
    }
    switch (HAL_ITEM(ipc->cmd))
    {
    case IPC_OPEN:
        stm32_otg_open_ep(USB_PORT(ipc->param1), exo, USB_NUM(ipc->param1), ipc->param2, ipc->param3);
        break;
    case IPC_CLOSE:
        stm32_otg_close_ep(USB_PORT(ipc->param1), exo, USB_NUM(ipc->param1));
        break;
    case IPC_FLUSH:
        stm32_otg_ep_flush(USB_PORT(ipc->param1), exo, USB_NUM(ipc->param1));
        break;
    case USB_EP_SET_STALL:
        stm32_otg_ep_set_stall(USB_PORT(ipc->param1), exo, USB_NUM(ipc->param1));
        break;
    case USB_EP_CLEAR_STALL:
        stm32_otg_ep_clear_stall(USB_PORT(ipc->param1), exo, USB_NUM(ipc->param1));
        break;
    case USB_EP_IS_STALL:
        ipc->param2 = stm32_otg_ep_is_stall(USB_PORT(ipc->param1), USB_NUM(ipc->param1));
        break;
    case IPC_READ:
        stm32_otg_read(exo, ipc);
        break;
    case IPC_WRITE:
        stm32_otg_write(exo, ipc);
        break;
    default:
        kerror(ERROR_NOT_SUPPORTED);
        break;
    }
}

void stm32_otg_request(EXO* exo, IPC* ipc)
{
    if (ipc->param1 == USB_HANDLE_DEVICE)
        stm32_otg_device_request(exo, ipc);
    else
        stm32_otg_ep_request(exo, ipc);
}
